# GetCellCategoryId Method (Int32, Int32) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..GetCellCategoryId Method (Int32, Int32)
TableSectionData Class See Also
---
Returns a cell's CategoryId and if no CategoryId exists for this cell, it would come from the column. Associated with the paramId to find the correct element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId GetCellCategoryId(
	int nRow,
	int nCol
)
```

Visual Basic
---
```text
Public Function GetCellCategoryId ( _
	nRow As Integer, _
	nCol As Integer _
) As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetCellCategoryId(
	int nRow,
	int nCol
)
```

# ### Parameters
nRow
    Type: System..::..Int32
nCol
    Type: System..::..Int32
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given row number nRow is invalid. -or- The given column number nCol is invalid. |

# See Also
TableSectionData Class
GetCellCategoryId Overload
Autodesk.Revit.DB Namespace